Repository: nfa-vfxim/docs
Catalog: locale/*/LC_MESSAGES/docs/user/pipeline/pipeline_usage_guide.po
Languages: nl

source: Quick Usage Guide
nl: Snelle Gebruikers Gids

source: The pipeline uses *Shotgun Toolkit* as it's main platform. From within most DCC's you'll be able to open your latest workfile or load source files from other work into your program through the Shotgun tab.
nl: De pipeline gebruikt *Shotgun Toolkit* als platform. Binnen de meeste DCC's kan je hiermee de meest recente workfiles openen of source bestanden importeren van andere workfiles via de Shotgun Tab.

source: The Shotgun tab in Houdini.
nl: De Shotgun Tab in Houdini.

source: There are a number of important things you can control using this tab.
nl: Er zijn een aantal belangrijke dingen die je kan beheren via deze tab.

source: One of the most important things in a pipeline is accurate version control of all the workfiles. Through *Shotgun -> File Save* you can save your current workfile with automatic version increments. When you click *File Save* in a new untitled save file, you'll be greeted with a context selection screen. In this screen you'll see all shots and assets you are assigned tasks to. Select one and click save.
nl: Een van de belangrijkste aspecten van een pipeline is het bijhouden van versies in alle workfiles. Via *Shotgun -> File Save* kan je de huidige workfile opslaan met automatische versie optelling. Wanneer je *File Save* klikt in een nieuwe ongetitelde workfile zal je gegroet worden met een context selectie scherm. In dit scherm zal je alle shots en assets met taken waar je aan toegewezen bent zien. Selecteer er een en klik save.

source: As you can see in the lower left corner, there is a *name* box. This name box is filled with *scene* by default. You can change this as a way to further refine what you are working on. (If you are working on an asset that has multiple lines of workfiles, you could change this to reflect the part you are working on).
nl: Zoals je kan zien is er een *name* optie. Deze optie box wordt standaard gevuld met *scene*. Je kan deze optie veranderen om verder aan te duiden waar je aan werkt. (Als je bijvoorbeeld aan een asset werkt met meerdere onderdelen in verschillende workfiles kan je hier het onderdeel aangeven waar je aan werkt.

source: Once you have saved your empty file you can use ``ctrl + s`` to save your current file like usual. If you'd like to save a new version of the current file you can again hit *Shotgun -> File Save* to quickly save a new version.
nl: Wanneer je een lege file hebt opgeslagen kan je ``ctrl + s`` gebruiken om je file opnieuw op te slaan zoals gewoonlijk. Wanneer je een nieuwe versie wilt opslaan kan je opnieuw *Shotgun -> File Save* aanklikken om snel een nieuwe versie aan te maken.

source: After you have saved your file through the pipeline you'll notice some more options open up, like publishing files, load, scene breakdown etc.
nl: Nadat je een bestand hebt opgeslagen via de pipeline zal je merken dat meer opties in de Shotgun tab komen te staan.

source: If you are not starting from scratch but continuing from someone else's work, you'll want to click *Shotgun -> File Open*. In this screen you'll also be greeted with any tasks you are assigned to. When clicking on an entity you'll see all the workfiles other artists have already made.
nl: Wanneer je niet in een compleet nieuw bestand begint, maar wilt verder werken vanaf iemand anders z'n werk zal je op *Shotgun -> File Open* moeten klikken. In dit scherm word je wederom gegroet door alle taken waar je aan bent toegewezen. Wanneer je op een bepaald shot of asset klikt zal je alle andere workfiles te zien krijgen die anderen al hebben gemaakt.

source: You can open other work files or create a new file from this context.
nl: Je kan andere workfiles openen of een nieuwe file creeëren vanuit deze context.

source: An important distinction to be made is the difference between published files and workfiles. Workfiles are files where the work is actively being made while published files are files meant to be loaded by other workfiles. For example, if you have created a rig in Maya you would publish that file so that other people can load & reference that rig. To publish the current workfile and any items that are found inside (for example a file cache node or a set of rendered ``exr``'s) click *Shotgun -> Publish*.
nl: Een belangrijk verschil dat gemaakt moet worden is het verschil tussen workfiles en gepubliceerde files. Workfiles zijn files waar je actief in werkt terwijl gepubliceerde files bedoelt zijn om door andere artists te importeren in hún workfiles. Voorbeeld: wanneer er een rig gemaakt is in Maya publiceer je deze Maya file zodat anderen deze rig kunnen importeren en referencen. Om een publish te maken van de huidige workfile klik je op *Shotgun -> Publish*. Items zoals gerenderde EXR's of caches worden automatisch onder de workfile aangemaakt als extra items om te importeren.

source: If you have used a file cache node, or have rendered a file you will notice that the publisher automatically picks up those files and creates an item for them. Use the description and thumbnail to provide reference for other people who will load in these published files.
nl: Als je een file cache node hebt gebruikt of een sequentie heb gerenderd zal de publisher automatisch deze files oppikken en er een item voor creeëren. Gebruik de thumbnail en descriptie om extra aanduiding te geven voor anderen die deze publish gaan gebruiken.

source: The load app is used to load any published files from the project into your current work file. For example renders from CG that need to be loaded by Nuke or a simulation that was file cached by another artist that now needs to be loaded into the layout file.
nl: De load app wordt gebruikt om gepubliceerde files te importeren in je huidige workfile.Bijvoorbeeld CG renders die ingeladen moeten worden in Nuke of een simulatie die gecached is door een andere artist die nu in de layout file moet komen.

source: Obviously not all software takes in all files. (Like trying to import a ``.bgeo.sc`` cache into Nuke) The loader will automatically only show files that the current software can import.
nl: Uiteraard kan niet elke software alle soorten files importeren. (Bijvoorbeeld een ``.bgeo.sc`` file in Nuke) De loader laat automatisch alleen maar de bestanden zien die ook daadwerkelijk kunnen worden ingeladen.

source: If you have loaded any assets or files from other artists there's a good chance they'll be updated every once in a while. The scene breakdown app keeps track of all the published files you currently have imported in your workfile and shows a red or green light if it's out-of-date or up-to-date. You can individually update or update all references.
nl: Als je assets of andere files hebt ingeladen van andere artists is er een goede kans dat die nog eens worden geupdate. De scene breakdown app houdt bij welke published files er in je huidige bestand zitten. Het laat een rood of groen lampje zijn als het bestand out-of-date of up-to-date is.Je kan hier elk bestand individueel updaten of alle files tegelijk.

source: This particular asset has a newer version to be updated.
nl: Deze specifieke assset heeft een nieuwere versie die kan worden geupdate.
